src/cf/Catalogs/ItobМестоположенияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ItobМестоположенияПоУмолчанию</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ItobМестоположенияПоУмолчанию/Forms/ФормаОпределенияПоложения/Ext/Form/Module.bsl
#Область ОписаниеПеременных
	
&НаКлиенте
Перем мСчетчикДокументСформирован;  // Переменная содержит счетчик сформированных документов

#КонецОбласти 

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мСчетчикДокументСформирован = 0;
	
	АтрибутыКарты = "";
	Если Широта <> 0 И Долгота <> 0 И МасштабКарты <> 0 Тогда
		
		АтрибутыКарты = 
			"firstZoom = "+Формат(МасштабКарты,"ЧГ=0")+";
			|firstLat = "+ItobОбщегоНазначенияКлиентСервер.ФорматироватьКоординаты(Широта)+";
			|firstLon = "+ItobОбщегоНазначенияКлиентСервер.ФорматироватьКоординаты(Долгота)+";";		
		
	КонецЕсли;
	
	ПолеHTML = ItobОперативныйМониторингКлиентСервер.ПолучитьАдресКарты(АтрибутыКарты);
	
КонецПроцедуры

// Процедура - обработчик события "ДокументСформирован" поля HTML "ПолеHTML".
//
&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
		
	Если Элементы.ПолеHTML.Документ.readyState = "complete" Тогда
		мСчетчикДокументСформирован = мСчетчикДокументСформирован + 1;
		Элементы.КнопкаОК.Доступность = Истина;
	КонецЕсли; 
		
КонецПроцедуры

// Процедура - обработчик события "ПриНажатии" поля HTML "ПолеHTML".
//
&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ItobОперативныйМониторингКлиент.ОбработатьНажатиеНаПолеКарты(Элемент, ДанныеСобытия, СтандартнаяОбработка);	
	
КонецПроцедуры

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Широта  = ?(Параметры.Свойство("Широта"), Параметры.Широта, 0);
	ЭтаФорма.Долгота = ?(Параметры.Свойство("Долгота"),Параметры.Долгота,0);
	ЭтаФорма.МасштабКарты = ?(Параметры.Свойство("Масштаб"),Параметры.Масштаб,0);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "УвеличитьКарту".
//
&НаКлиенте
Процедура УвеличитьКарту(Команда)

	ВыполнитьСкрипт("m_map.zoomIn();");	
	
КонецПроцедуры // УвеличитьКарту()

// Процедура - обработчик команды "УменьшитьКарту".
//
&НаКлиенте
Процедура УменьшитьКарту(Команда)
		
	ВыполнитьСкрипт("m_map.zoomOut();");		
	
КонецПроцедуры // УменьшитьКарту()

// Процедура - обработчик команды "КомандаОК".
//
&НаКлиенте
Процедура КомандаОК(Команда)
		
	Попытка	
		ТекстСкрипта = "document.form.result.value = m_map.getZoom();";		
		ВыполнитьСкрипт(ТекстСкрипта);	
		МасштабКарты = Элементы.ПолеHTML.Документ.form.result.value;
		
		ТекстСкрипта = 
		    "var pt = m_map.getCenter();
			|pt.transform(m_map.getProjectionObject(), m_map.displayProjection);
			|document.form.result.value = pt.toShortString();
			|pt = null;";
		ВыполнитьСкрипт(ТекстСкрипта);
		СтрокаКоординат = Элементы.ПолеHTML.Документ.form.result.value;		
		СтрокаКоординат = СтрЗаменить(СтрокаКоординат,",",Символы.ПС);
		
		Долгота = Число(СокрЛП(СтрПолучитьСтроку(СтрокаКоординат,1)));
		Широта  = Число(СокрЛП(СтрПолучитьСтроку(СтрокаКоординат,2)));	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
	КонецПопытки;	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Масштаб", МасштабКарты);
	ДопПараметры.Вставить("Широта",  Широта);
	ДопПараметры.Вставить("Долгота", Долгота);
	ДопПараметры.Вставить("КодВозвратаДиалога", КодВозвратаДиалога.ОК);
	Закрыть(ДопПараметры);		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет скрипт на поле HTML, с учетом вида браузера.
//
&НаКлиенте
Процедура ВыполнитьСкрипт(ТекстСкрипта)
	
	Если мСчетчикДокументСформирован < 1
		 ИЛИ НЕ Элементы.ПолеHTML.Документ.readyState = "complete" Тогда
		
		Возврат;	
	КонецЕсли;
	
	ItobОперативныйМониторингКлиент.ВыполнитьСкриптНаПолеHTML(Элементы.ПолеHTML, ТекстСкрипта);		

КонецПроцедуры

#КонецОбласти
